Repository: masakhane-io/masakhane-mt
Catalog: Data/en-ig Tech Sentences/en-ig.tmx
Source language: en
Languages: ig

source: Window 0x%lx has property %s that was expected to have type %s format %d and actually has type %s format %d n_items %d. This is most likely an application bug, not a window manager bug. The window has title="%s" class="%s" name="%s"
ig: Windo 0x%lx nwere ngwaọrụ %s nke echere na ọ ga-enwe ụdị %s ọdịdị %d ma kpọmkwem nwee ụdị %s ọdịdị %d n_items %d. Nke a bụ nsogbu usoroiheomume nke kacha nke, ọbụghị nsogbu onyenlekọta windo. Windo ahụ nwere isiokwu="%s" kláàsị̀="%s" aha="%s"

source: Property %s on window 0x%lx contained invalid UTF-8
ig: Ngwaọrụ %s na windo 0x%lx nwere UTF-8 na-enweghị isi

source: Property %s on window 0x%lx contained invalid UTF-8 for item %d in the list
ig: Ngwaọrụ %s na windo 0x%lx nwere UTF-8 na-enweghị isi maka ihenhọrọ %d n'ime ihendesịta

source: Switch to workspace 1
ig: Banye na wọ́kspéèsì 1

source: Switch to workspace 2
ig: Banye na wọ́kspéèsì 2

source: Switch to workspace 3
ig: Banye na wọ́kspéèsì 3

source: Switch to workspace 4
ig: Banye na wọ́kspéèsì 4

source: Switch to workspace 5
ig: Banye na wọ́kspéèsì 5

source: Switch to workspace 6
ig: Banye wọ́kspéèsì 6

source: Switch to workspace 7
ig: Banye na wọ́kspéèsì 7

source: Switch to workspace 8
ig: Banye na wọ́kspéèsì 8

source: Switch to workspace 9
ig: Banye na wọ́kspéèsì 9

source: Switch to workspace 10
ig: Banye na wọ́kspéèsì 10

source: Switch to workspace 11
ig: Banye na wọ́kspéèsì 11

source: Switch to workspace 12
ig: Swichie na wọkspeesi 12

source: Switch to workspace on the left of the current workspace
ig: Banye na wọ́kspéèsì n'akaekpe

source: Switch to workspace on the right of the current workspace
ig: Banye na wọ́kspéèsì n'akanri

source: Switch to workspace above the current workspace
ig: Banye na wọ́kspéèsì n'elu nke a

source: Switch to workspace below the current workspace
ig: Banye na wọ́kspéèsì n'ala nke a

source: Move between windows of an application, using a popup window
ig: Kpụgharịa n'etiti windo ya na pọpọp

source: Move backward between windows of an application, using a popup window
ig: Kpụghachi fókọ́ọ̀sụ̀ azụ n'etiti windo ndị ahụ n'iji ngosi pọpọp

source: Move between windows, using a popup window
ig: Kpụgharịa n'etiti windo ya na pọpọp

source: Move backward between windows, using a popup window
ig: Kpụghachi fókọ́ọ̀sụ̀ azụ n'etiti windo ndị ahụ n'iji ngosi pọpọp

source: Move between panels and the desktop, using a popup window
ig: Kpụgharịa n'etiti pánēèlụ̀ na desktọ́ọ̀pụ̀ ya na pọpọp

source: Move backward between panels and the desktop, using a popup window
ig: Kpụghachi azụ n'etiti pánēèlụ̀ na desktọ́ọ̀pụ̀ ya na pọpọp

source: Move between windows of an application immediately
ig: Kpụgharịa n'etiti windo ozugbo

source: Move backward between windows of an application immediately
ig: Kpụghachi azụ n'etiti windo ozugbo

source: Move between windows immediately
ig: Kpụgharịa n'etiti windo ozugbo

source: Move backward between windows immediately
ig: Kpụghachi azụ n'etiti windo ozugbo

source: Move between panels and the desktop immediately
ig: Kpụgharịa n'etiti pánēèlụ̀ na desktọ́ọ̀pụ̀ ozugbo

source: Move backward between panels and the desktop immediately
ig: Kpụghachi azụ n'etiti pánēèlụ̀ na desktọ́ọ̀pụ̀ ozugbo

source: Hide all normal windows and set focus to the desktop
ig: Zòó windo niile ma gbado ụkwụ na desktọ́ọ̀pụ̀

source: Show the panel's main menu
ig: Gosi pánēèlụ̀ menu ahụ

source: Show the panel's "Run Application" dialog box
ig: Gosi pánēèlụ̀ mbido usoroiheomume dayalọ́ọ̀gụ̀

source: Take a screenshot
ig: Skrììnshọ́ọ̀tụ̀ọ́

source: Take a screenshot of a window
ig: Skrììnshọ́ọ̀tụ̀ọ́ na windo

source: Run a terminal
ig: Bido ngwaọrụ mbupụ na mbubata ozi

source: Activate the window menu
ig: Mee ka Windo menu rụwa orụ

source: Toggle fullscreen mode
ig: Pịa na móòdù fúlskríìn

source: Toggle maximization state
ig: Pịa n'ọnọdụ mbawanye

source: Toggle whether a window will always be visible over other windows
ig: Budata windo n'okpuru windo ndị ọzọ

source: Maximize window
ig: Bawanye windo

source: Restore window
ig: Megharịa ụhara windo

source: Toggle shaded state
ig: Pịa n'ọnọdụ shéèdì

source: Minimize window
ig: Webilata windo

source: Close window
ig: Mechie windo

source: Move window
ig: Kpụgharịa windo

source: Resize window
ig: Megharịa ụhara windo

source: Toggle whether window is on all workspaces or just one
ig: Pịa windo na wọ́kspéèsì niile

source: Move window to workspace 1
ig: Kpụga windo na 1wọ́kspēèsì

source: Move window to workspace 2
ig: Kpụga windo na 2 wọ́kspēèsì

source: Move window to workspace 3
ig: Kpụga windo na 3 wọ́kspēèsì

source: Move window to workspace 4
ig: Kpụga windo na 4 wọ́kspēèsì

source: Move window to workspace 5
ig: Kpụga windo na 5 wọ́kspēèsì

source: Move window to workspace 6
ig: Kpụga windo na 6 wọ́kspēèsì

source: Move window to workspace 7
ig: Kpụga windo na 7wọ́kspēèsì

source: Move window to workspace 8
ig: Kpụga windo na 8 wọ́kspēèsì

source: Move window to workspace 9
ig: Kpụga windo na 9 wọ́kspēèsì

source: Move window to workspace 10
ig: Kpụga windo na 10 wọ́kspēèsì

source: Move window to workspace 11
ig: Kpụga windo na 11 wọ́kspēèsì

source: Move window to workspace 12
ig: Kpụga windo na 12 wọ́kspēèsì

source: Move window one workspace to the left
ig: Kpụga windo n'otu wọ́kspēèsì n'akaekpe

source: Move window one workspace to the right
ig: Kpụga windo n'otu wọ́kspēèsì n'akanri

source: Move window one workspace up
ig: Kpụga windo n'otu wọ́kspēèsì n'elu

source: Move window one workspace down
ig: Kpụga windo n'otu wọ́kspēèsì ala

source: Raise window if it's covered by another window, otherwise lower it
ig: Welite windo a na-ahụchaghị anya, kama budata

source: Raise window above other windows
ig: Welite n'elu windo ndị ọzọ

source: Lower window below other windows
ig: Budata windo n'okpuru windo ndị ọzọ

source: Maximize window vertically
ig: Bawanye windo n'ụdị vatikal

source: Maximize window horizontally
ig: Bawanye windo n'ụdị horizontal

source: Move window to north-west (top left) corner
ig: Kpụga windo n'otu wọ́kspēèsì n'akaekpe

source: Move window to north-east (top right) corner
ig: Kpụga windo n'otu wọ́kspēèsì n'akanri

source: Move window to center of screen
ig: Kpụga windo n'otu wọ́kspēèsì ala

source: Modifier to use for modified window click actions
ig: Omemmegharị ga-eji maka mmem ọ̀pị̀pị́ windo mmegharị

source: Clicking a window while holding down this modifier key will move the window (left click), resize the window (middle click), or show the window menu (right click). The left and right operations may be swapped using the "mouse_button_resize" key. Modifier is expressed as "lt;Altgt;" or "lt;Supergt;" for example.
ig: Ịpị windo mgbe ijigidere kíì omemmegharị a ga-akpụgha windo (pịa n'akaekpe), megharịa ụhara windo (pịa n'etiti), mọọbụ gosi windo menu (pịa n'akanri). A kọwara omemmegharị dịka "lt;Altgt;" mọọbụ "lt;Supergt;" ọmụmatụ.

source: Arrangement of buttons on the titlebar
ig: Nhazi nke bọtịn ndị ahụ na taịtụlbaa

source: Arrangement of buttons on the titlebar. The value should be a string, such as "menu:minimize,maximize,spacer,close"; the colon separates the left corner of the window from the right corner, and the button names are comma-separated. Duplicate buttons are not allowed. Unknown button names are silently ignored so that buttons can be added in future metacity versions without breaking older versions. A special spacer tag can be used to insert some space between two adjacent buttons.
ig: Nhazi nke bọtịn ndị ahụ na taịtụlbaa. Valiu ahụ ga-abụ ahịrịokwu, dịka "menu:minimize,maximize,close"; kpọm elu na ala kewara akụkụ akaekpe nke windo site n'akụkụ akanri, rịkọm kewasị̤rị aha bọtịnị ndị ahụ. anabataghị ídùplìkéètì bọtịnị ndị ahụ. E ji nwayọọ leghara bọtịnị ndị a na-amaghị anya ka agbakwunye bọtịnị ahụ na-agbanke metacity na ndịniihu na-akwụsịtụghị agbanke ochie.

source: Window focus mode
ig: Móòdù fókọ́ọ̀sụ̀ windo

source: The window focus mode indicates how windows are activated. It has three possible values; "click" means windows must be clicked in order to focus them, "sloppy" means windows are focused when the mouse enters the window, and "mouse" means windows are focused when the mouse enters the window and unfocused when the mouse leaves the window.
ig: Windo fókọ́ọ̀sụ̀ móòdù na-egosi etu windo arụ ọrụ. Onwere uru atọ dị omume; "click" pụtara na a ga-apịnye windo ndị ahụ ka é fókọ́ọ̀sụ̀ọ́ na ha, "sloppy" pụtara na é fōkọ́ọ̀sụ̀rụ̀ na windo ndị ahụ mgbe máụ̀sụ̀ banyere na windo, nakwa "mouse" pụtara na é fōkọ́ọ̀sụ̀rụ̀ windo mgbe máụ̀sụ̀ banyere na windo ahụ ma ọ̀nfókọ́ọ̀sụ̀ọ́ mgbe máụ̀sụ̀ ahụ hapụrụ windo ahụ.

source: Action on title bar double-click
ig: Mmem na taịtụl báà pịa-mpịkwasa

source: Action on title bar middle-click
ig: Mmem na taịtụl báà pịa-mpịkwasa

source: Action on title bar right-click
ig: Mmem na taịtụl báà pịa-mpịkwasa

source: Automatically raises the focused window
ig: Ji aka ya welite windo ebe fōkọ́ọ̀sụ̀rụ̀

source: If set to true, and the focus mode is either "sloppy" or "mouse" then the focused window will be automatically raised after a delay specified by the auto_raise_delay key. This is not related to clicking on a window to raise it, nor to entering a window during drag-and-drop.
ig: Ọ bụrụ na ọ bu eziokwu, nakwa fókọ́ọ̀sụ̀ móòdù ahụ nwereike bụrụ "sloppy" mọọbụ "mouse" mgbe ahụ windo fókọ́ọ̀sụ̀ ga eji aka ya welite onwe ya n'ogbugbu oge ahụ (Ezipụtara ogbugbu oge ahụ site na kíì auto_raise_delay).

source: Delay in milliseconds for the auto raise option
ig: Ogbugbu oge na milisekọndụ ndị ahụ maka ihenhọrọ nwelite nkeonwe

source: The time delay before raising a window if auto_raise is set to true. The delay is given in thousandths of a second.
ig: Oge egburu tupuu nwelite windo ọ bụrụ na auto_raise na ahaziri ya ka ọ bụrụ eziokwu. A ga-enye ogbugbu oge ahụ na tawụzan nke otu sekọndụ.

source: Current theme
ig: Isiokwu ọfụụ

source: The theme determines the appearance of window borders, titlebar, and so forth.
ig: Isiokwu ahụ na-ezipụta ngosipụta agbata windo, taịtụlbáà, na ndị ọzọ.

source: Use standard system font in window titles
ig: Jiri sistem ihumkpụrụedemede nke bụ ákpụ̀ n'isiokwu windo ndị ahụ

source: If true, ignore the titlebar_font option, and use the standard application font for window titles.
ig: Ọ bụrụ na ọ bụ eziokwu, leghara nhọrọ tittlebar_font anya, ma jiri ihumkpụrụedemede usoroiheomume anabatara maka isiokwu windo ndị ahụ.

source: Window title font
ig: Ihumkpụrụedemede isiokwu windo

source: A font description string describing a font for window titlebars. The size from the description will only be used if the titlebar_font_size option is set to 0. Also, this option is disabled if the titlebar_uses_desktop_font option is set to true.
ig: Ihumkpụrụedemede nkọwa ahịrịokwu na-akọwa ihumkpụrụedemede maka windo taịtụlbáà ndị ahụ .A ga-eji sọsọ ụhara site na nkọwa ma ọ bụrụ na a haziri ihenhọrọ tittlebar_font_size na 0, Ka a na-aga. Tinyekwara, ihenhọrọ a ga-emebi ma ọ bụru na a haziri ihenhọrọ tittlebar_uses_desktop_font nà eziokwu.Site na dìfọ́ọ̀ltụ̀, a hazibeghị tittlebar_font, na-ebutere metacity ńdábèghàchí n'ihumkpụrụedemede desktọ́ọ̀pụ̀ ọbụnagodi ma tittlbar_uses_desktop_font ọ bụ asị.

source: Number of workspaces
ig: Ọnụọgụgụ wọ́kspēèsì

source: Number of workspaces. Must be more than zero, and has a fixed maximum to prevent making the desktop unusable by accidentally asking for too many workspaces.
ig: Ọnụọgụgụ wọ́kspēèsì. Ga-akarịrị nkịtị, ma nwe nwelite na-enweghị mgbanwe (N'igbochi n'inyo mebie desktọ́ọ̀pụ̀ gị site n'ịjụ maka 34 miliọn wọ́kspēèsì ndị ahụ).

source: Enable Visual Bell
ig: Na-ekwe mgbịrịgba nlechapụta

source: Turns on a visual indication when an application or the system issues a 'bell' or 'beep'; useful for the hard-of-hearing and for use in noisy environments.
ig: N'atụgharị ná ngosi ihenlereanya mgbe usoroiheomume mọọbụ ozi sistem nke bụ̄ 'mgbịrịngba' mọọbụ 'ọ̀kụ́kụ́'; na-aba uru maka ịnụsị-ihe-ike nakwa iji ya n'ebe ụ̀zụ̀ dị̀, mọọbụ mgbe 'mgbịrịgba ndasiike' kwụsịrị.

source: System Bell is Audible
ig: Bell sistem n'ada ụda

source: Determines whether applications or the system can generate audible 'beeps'; may be used in conjunction with 'visual bell' to allow silent 'beeps'.
ig: ga-ekwu ma usoroiheomume mọọbụ sistem ahụ ga-ewepụta nnukwu 'ụda'; nwere ike jiri na njikọ nke ya na 'mgbịrịgba nlechapụta' ka ekwe 'ọ̀wụ̀' bata.

source: Visual Bell Type
ig: Ụdị mgbịrịgba ihenlereanya

source: Tells Metacity how to implement the visual indication that the system bell or another application 'bell' indicator has been rung. Currently there are two valid values, "fullscreen", which causes a fullscreen white-black flash, and "frame_flash" which causes the titlebar of the application which sent the bell signal to flash. If the application which sent the bell is unknown (as is usually the case for the default "system beep"), the currently focused window's titlebar is flashed.
ig: Na-agwa Metacity etu ọ ga-esi mepụta ngosi nlechapụta na sistem mgbịrịgba mọọbụ usoroiheomume ọzọ 'mgbịrịgba' akụọla ngwaọrụ ngosi. Ugbua e nwere valiu nwereisi abụọ, "fullscreen", nke n'ebutere njupụtainyogo waịt-blak flashị, na "frame_flash" nke n'ebutere taịtụlbáà nke usoroiheomume nke zigara signáàlụ̀ mgbịrịgba ahụ na flashị. Ọ bụrụ na-amaghị usoroiheomume nke zigara mgbịrịgba ahụ (Ka ọ dị bu kéèsì maka dìfọ́ọ̀ltụ̀ "system beep"), A fláàshị̀rị̀ windo fókọ́ọ̀sụ̀ taịtụlbáà nọ mgbe ahụ.

source: Name of workspace
ig: Aha wọ́kspēèsì

source: The name of a workspace.
ig: Aha wọ́kspéèsì.

source: If true, trade off usability for less resource usage
ig: Ọ bụrụ na ọ bụ eziokwu, tréèdìá ọ́ọ̀fụ̀ njieme maka mbelata nsirinweta njieme

source: If true, metacity will give the user less feedback by using wireframes, avoiding animations, or other means. This is a significant reduction in usability for many users, but may allow legacy applications to continue working, and may also be a useful tradeoff for terminal servers. However, the wireframe feature is disabled when accessibility is on.
ig: Ọ bụrụ na ọ bụ eziokwu, metacity ga-enye ojieme nzighachi na echiche n'ejughị afọ nke "direct manipulation", site n'iji wáyáfréms, na-ezere animeshiọn, mọọbụ n'ụzọ ọzọ.Nke a bụ nwebilata na njieme maka ndị ojieme, ma nwe ike ihapụ usoroiheomume ochie na sava ngwaọrụ mbupụ na mbubataozi ka ha rụwa ọrụ ebe kama ha ekwesịghị ịrụ ọrụ. Ka ọ na-aga, emebiri iheọrụ wáyáfrém ahụ mgbe ikikembanye na-arụ ọrụ ka e zere mmebi desktọ́ọ̀pụ̀ ochie.

source: Run a defined command
ig: Bido ntiiwu a kọwara akọwa

source: The keybinding that runs the correspondingly-numbered command in /apps/metacity/keybinding_commands The format looks like "lt;Controlgt;a" or "lt;Shiftgt;lt;Altgt;F1". The parser is fairly liberal and allows lower or upper case, and also abbreviations such as "lt;Ctlgt;" and "lt;Ctrlgt;". If you set the option to the special string "disabled", then there will be no keybinding for this action.
ig: Kiibaịndịn ahụ nke na-ebido ntiiiwu ọnụọgụgụ na-adaba adaba na /apps/metacity/keybinding_commands Ọdịdị ahụ dị̀kà "lt;Controlgt;a" mọọbụ"lt;Shiftgt;lt;Altgt;F1".Ọtọsa ngwe dị̀ líbrààlụ̀ ma hapụ kéèsì nke ala mọọbụ nke elu, ya na inwe mkpọbiri aha dịka "lt;Ctlgt;" na "lt;Ctrlgt;" Ọ bụrụ n'ihazie ihenhọrọ niile ahụ n'ahịrịokwu pụrụ iche "disabled", mgbe ahụ agaghị enwe kiibaịndịn maka mmem a.

source: Commands to run in response to keybindings
ig: Ntiiwu iji bido na nzighachi na kíìbaịndịn ndị ahụ

source: The /apps/metacity/global_keybindings/run_command_N keys define keybindings that correspond to these commands. Pressing the keybinding for run_command_N will execute command_N.
ig: /apps/metacity/global_keybindings/run_command_N Kii ahụ nke na-akọwa kiibaịndịn ndị ahụ nke na-adaba ntiiwu ndị a. Ịpị kiibaịndịn maka run_command_N ga-emepụta command_N.

source: The screenshot command
ig: Skrììnshọ́ọ̀tụ̀ọ́ ntiiwu

source: The /apps/metacity/global_keybindings/run_command_screenshot key defines a keybinding which causes the command specified by this setting to be invoked.
ig: /apps/metacity/global_keybindings/run_command_screenshot Kii ahụ na-akọwa kiibaịdịn nke n'ebute ntiiwu ezipụtara site na nhazi à á ga-atụtegharị.

source: The window screenshot command
ig: Windo ahụ skrììnshọ́ọ̀tụ̀rụ̀ ntiiwu

source: The /apps/metacity/global_keybindings/run_command_window_screenshot key defines a keybinding which causes the command specified by this setting to be invoked.
ig: /apps/metacity/global_keybindings/run_command_window_screenshot Kii na-akọwa kiibaịndịn nke n'ebute ntiiwu ezipụtara site na nhazi à á ga-atụtegharị.

source: (Not implemented) Navigation works in terms of applications not windows
ig: (Ewepụtaghị ya) Ngagharị n'arụ ọrụ dịka usoroiheomume ọ bụghị Windo

source: If true, then Metacity works in terms of applications rather than windows. The concept is a bit abstract, but in general an application-based setup is more like the Mac and less like Windows. When you focus a window in application-based mode, all the windows in the application will be raised. Also, in application-based mode, focus clicks are not passed through to windows in other applications. Application-based mode is, however, largely unimplemented at the moment.
ig: Ọ bụrụ na ọ bụ eziokwu, Metacity ga-arụ ọrụ dịka nke usoroiheomume karia nke windo. echiche ahụ dị̀tụ̀ nwa abstraktị, mana abịa na zurugbezurugbe nrụnye béèzì-usoroiheomume dịka Mac ma belata dịka windo. Mgbe ị fōkọ́ọ̀sụ̀rụ̀ windo móòdù béèzì-usoriheomume, a ga-ewelite windo niile ahụ nọ n'ime usoroiheomume, Ọzọkwa, na moodu béèzì-usoroiheomume, ọpịpị fokọọsụ anaghị agafe na windo ndị ahụ n'usoroiheomume ndị ọzọ. Ọdịdị nke nhazi a nwere obere ajụjụ. Mana ọ ka mma inwe nhazi maka ndesịta mmem kpọmkwem nke nhazi nke béèzì-usoroiheomume nà. béèzì-windo, ọmụmatụ. ma ọ bụ igakwa na ọ̀pị̀pị̀. Ọzọkwa, ewepụtaghị móòdù béèzì-usoroiheomume buru ibu n'oge ahụ.

source: Disable misfeatures that are required by old or broken applications
ig: Enweghị iheọrụ mabiri emebi nke achọrọ site na nke ochie mọọbụ nkwụsị usoroiheomume ndị ahụ

source: Usage: %s
ig: Njieme: %s

source: Close Window
ig: Mechie Windo

source: Window Menu
ig: Windo menu

source: Minimize Window
ig: Webilata Windo

source: Maximize Window
ig: Bawanye Windo

source: Restore Window
ig: Megharịa ụhara windo

source: Roll Up Window
ig: Mkpụli_elu

source: Unroll Window
ig: Mechie Windo

source: Always On Visible Workspace
ig: _Na-anọkarị na wọ́kspéèsì a hụrụ anya

source: Put Window On Only One Workspace
ig: Pịa windo na wọ́kspéèsì niile

source: Mi_nimize
ig: We_bilata

source: Ma_ximize
ig: Ba_wanye

source: Unma_ximize
ig: Webil_ataụhara

source: Roll _Up
ig: Mkpụli_elu

source: _Unroll
ig: _Sáwàpụ̀tá

source: _Move
ig: _Kpụghaa

source: _Resize
ig: _Mmegharị ụhara

source: _Always on Visible Workspace
ig: _Na-anọkarị na wọ́kspéèsì a hụrụ anya

source: _Only on This Workspace
ig: _Sọsọ na wọ́kspéèsì a

source: Move to Workspace _Left
ig: Kpụga na wọ́kspéèsì _akaekpe

source: Move to Workspace R_ight
ig: Kpụga na wọ́kspéèsì a_kanri

source: Move to Workspace _Up
ig: Kpụga na wọ́kspéèsì _elu

source: Move to Workspace _Down
ig: Kpụga na wọ́kspéèsì _ala

source: _Close
ig: _Mechie

source: Workspace %d%n
ig: Wọ́kspéèsì %d

source: Workspace 1_0
ig: Wọ́kspéèsì 1_0

source: Workspace %s%d
ig: Wọ́kspéèsì %s%d

source: Move to Another _Workspace
ig: Kpụga na _wọ́kspéèsì ọzọ

source: Shift
ig: Kpụkeje

source: Super
ig: Ike

source: Hyper
ig: Haịpa

source: Mod2
ig: Mọd2

source: Mod3
ig: Mọd3

source: Mod4
ig: Mọd4

source: Mod5
ig: Mọd5

source: top
ig: Elu

source: bottom
ig: Okpuru

source: left
ig: Akaekpe

source: right
ig: Akanri

source: frame geometry does not specify "%s" dimension
ig: Jiometịrị fréèmù ezipụtaghị "%s" mpaghara

source: frame geometry does not specify dimension "%s" for border "%s"
ig: Jiometịrị fréèmù ezipụtaghị mpaghara "%s" maka agbata "%s"

source: Button aspect ratio %g is not reasonable
ig: Bọtịn aspektị reshio %g abụghị nke echere n'echiche

source: Frame geometry does not specify size of buttons
ig: Jiometịrị fréèmù ezipụtaghị ụhara nke bọtịn

source: Gradients should have at least two colors
ig: Mmakọ ụcha kwesịrị inwe ọbụnaghị ụcha abụọ

source: GTK color specification must have the state in brackets, e.g. gtk:fg[NORMAL] where NORMAL is the state; could not parse "%s"
ig: GTK nzipụta ụcha ga-enwe ọnọdụ n'ụdị akara mmechi, ọmụmaatụ. gtk:fg[NORMAL] ebe NỌ́MÁÀLỤ̀ bụ ọnọdụ; agaghị enwenwu ike ịtọsasi "%s"

source: GTK color specification must have a close bracket after the state, e.g. gtk:fg[NORMAL] where NORMAL is the state; could not parse "%s"
ig: GTK nzipụta ụcha ga-enwe akara mmechi ma agachaa ọnọdụ, ọmụmaatụ. gtk:fg[NORMAL] ebe NỌ́MÁÀLỤ̀ bụ ọnọdụ; agaghị enwenwu ike ịtọsasi "%s"

source: Did not understand state "%s" in color specification
ig: Aghọtaghị ọnọdụ "%s" na nzipụta ụcha

source: Did not understand color component "%s" in color specification
ig: Aghọtaghị ọnọdụ mpaghara ụcha "%s" na nzipụta ụcha

source: Blend format is "blend/bg_color/fg_color/alpha", "%s" does not fit the format
ig: Mmezie ọdịdị bụ "blend/bg_color/fg_color/alpha", "%s" ọdabaghị n'ọdịdị

source: Could not parse alpha value "%s" in blended color
ig: Agaghị atọsasị uru alpha "%s" n'ụcha amakọrọ ọfụma

source: Alpha value "%s" in blended color is not between 0.0 and 1.0
ig: Valiu alpha "%s" n'ụcha amakọrọ ọfụma anọghị n'etiti 0.0 na 1.0

source: Shade format is "shade/base_color/factor", "%s" does not fit the format
ig: Ọdịdị shéèdì bụ "shade/base_color/factor", "%s" ọdaghị n'ọnọdụ

source: Could not parse shade factor "%s" in shaded color
ig: Agaghị atọsasịnwu faktọ shéèdì "%s" n'ụcha éshéèdị̀rị̀ èshéèdị̀

source: Shade factor "%s" in shaded color is negative
ig: Shéèdị̀ faktọ "%s" n'ụcha éshéèdị̀rị̀ èshéèdì dị negetíìvù

source: Could not parse color "%s"
ig: Agaghị atọsasịnwu ụcha "%s"

source: Coordinate expression contains character '%s' which is not allowed
ig: Chịkọlata nkọwa nwere mkpụrụokwu '%s' nke a na-anabataghị

source: Coordinate expression contains floating point number '%s' which could not be parsed
ig: Chịkọlata nkọwa nwere ọnụọgụgụ pọịntị n'ehu ehu '%s' nke ga-agaghị enwenwu ike ntọsasị

source: Coordinate expression contains integer '%s' which could not be parsed
ig: Chịkọlata nkọwa nwere ịntiga '%s' nke ga-agaghị enwenwu ike ntọsasị

source: Coordinate expression contained unknown operator at the start of this text: "%s"
ig: Chịkọlata nkọwa nwere òpèrétọ̀ á ná-ámághị́ na mbido nke ngwe a: "%s"

source: Coordinate expression was empty or not understood
ig: nchịkọlata nkọwa ghè óghē mọọbụ na aghọtaghị ya

source: Coordinate expression results in division by zero
ig: Mpụtara nchịkọlata nkọwa na nkewa site na zero

source: Coordinate expression tries to use mod operator on a floating-point number
ig: Nchịkọlata nkọwa nà-ánwà iji ọ̀pèrétọ̀ mood n'ọnụọgụgụ pọịntị-n'éhū èhù

source: Coordinate expression has an operator "%s" where an operand was expected
ig: Nchịkọlata nkọwa nwere ọ̀pèrétọ̀ "%s" ebe achọrọ ópērándị̀

source: Coordinate expression had an operand where an operator was expected
ig: Nchịkọlata nkọwa nwere ópērándị̀ ebe achọrọ ọ̀pèrètọ̀

source: Coordinate expression ended with an operator instead of an operand
ig: Nchịkọlata nkọwa gwụrụ ya na òpèrétọ̀ kama ópērándị̀

source: Coordinate expression has operator "%c" following operator "%c" with no operand in between
ig: Nchịkọlata nkọwa nwere ọ̀pèrétọ̀ "%c" na-eso ọ̀pèrétọ̀ "%c" ya na onweghị ópērándị̀ n'etiti
